//QRTC357 JOB (RTC,07),'INVENTORY FILE',   DOWNLOAD RTCD61 DATA 
//*   TYPRUN=SCAN,                
// %4,%5                                                     
/*ROUTE PRINT R2017                                                             
/*JOBPARM FORMS=LANB                                                          
/*RESOURCE C=1,T=1,K=RT
//*JOBLIB JCLLIB ORDER=(ABT.AB.PROCLIB,ABT.DV.PROCLIB)   PROD  VERS FIRST
//JOBLIB JCLLIB ORDER=(ABT.DV.PROCLIB,ABT.AB.PROCLIB)    TEST    VERS FIRST                                                     
//********************************************************************          
//*  10/07/2005 A DORFMAN        ORIGINAL                            * 
//*  05/20/2011 R Meinhardt      Expand field sizes                  *         
//******************************************************************** 
//RTC357XX PROC PARM='200803CY',FILE='RTCD20',GEN='(-0)',
//           SEC='AB',CNTL='DV'
//********************************************************************
//*  CREATES INVENTORY FILE FORMATTED FOR ESSBASE LOADING
//*  WHERE PARM057 DEFINES ESSBASE CELL LOADING INFO
//*         YYYY IS THE FISCAL YEAR FOR WHICH THE DATA IS DOWNLOADED
//*         VV   IS THE VERSION OF DATA DOWNLOADED,
//*                 WHEN 01=NOV, 02=APR AND 03=SEP
//*         TC   IS THE ESSBASE TARGET CELL DATA TYPE,
//*                 WHEN PY=PRIOR YEAR, CY=CURRENT YEAR
//*  AND FILE AS
//*         RTCD20 REFERS TO THE CURRENT YEAR INVENTORY
//*         RTCD25 REFERS TO THE INVENTORY YEAR END BACKUP
//*  AND GEN AS
//*         -0 REFERS TO CURRENT GENERATION DATA
//*         -N REFERS TO PREVIOUS GENERATION DATA
//*  AND SEC AS
//*         AB REFERS TO PRODUCTION DATASETS
//*         DV REFERS TO TEST DATASETS
//*  AND CNTL AS
//*         AB REFERS TO PRODUCTION SORTCARD MEMBERS
//*         DV REFERS TO TEST SORTCARD MEMBERS
//********************************************************************
//*RTC357UA EXEC  PGM=IEFBR14
//*RTCD61   DD DSN=ABT.&SEC..RTC.RTCD61,DISP=(MOD,DELETE),
//*            UNIT=SYSDA,SPACE=(TRK,1)
//*RTCD62   DD DSN=ABT.&SEC..RTC.RTCD62,DISP=(MOD,DELETE),
//*            UNIT=SYSDA,SPACE=(TRK,1)
//*********************************************************************
//*LOGMSG0   EXEC  PGM=LOGMSG,
//*             COND=(0,EQ,RTC357UA),PARM=ABEND
//*SYSIN     DD  DSN=ABT.AB.SORTCARD(UTILITY),DISP=SHR
//*********************************************************************
//*RTC357   EXEC PGM=RTC357,REGION=2048K,PARM=&PARM057
//*STEPLIB  DD DSN=ABT.AB.DUMMYLIB,DISP=SHR
//*               DD DSN=ABT.AB.PERMLIB,DISP=SHR
//*RTCD20   DD DSN=ABT.&SEC..RTC.&FILE.&GEN.,DISP=OLD   INVENTORY +I
//*RTCD61   DD DSN=ABT.&SEC..RTC.RTCD61,          DATA            +0
//*            DISP=(NEW,CATLG,DELETE),
//*            STORCLAS=BASE,
//*            MGMTCLAS=STDPROD,
//*            SPACE=(27000,(100,10),RLSE),
//*            DCB=(RECFM=FB,LRECL=30,BLKSIZE=0)
//*RTCD62   DD  DSN=ABT.&SEC..RTC.RTCD62,         TRIGGER
//*             DISP=(NEW,CATLG,DELETE),
//*             STORCLAS=BASE,
//*             MGMTCLAS=STDPROD,
//*             SPACE=(24000,(10,1),RLSE),
//*             DCB=(RECFM=FB,LRECL=8,BLKSIZE=0)
//*SYSOUT   DD SYSOUT=*
//*ABENDAID DD SYSOUT=A
//*ABNLTERM DD SYSOUT=*
//*SYSUDUMP DD SYSOUT=(A,,DUMP)
//*SORTWK01 DD UNIT=SYSDA,SPACE=(CYL,(05,01))
//*SORTWK02 DD UNIT=SYSDA,SPACE=(CYL,(05,01))
//*SORTWK03 DD UNIT=SYSDA,SPACE=(CYL,(05,01))
//*SORTWK04 DD UNIT=SYSDA,SPACE=(CYL,(05,01))
//*SORTWK05 DD UNIT=SYSDA,SPACE=(CYL,(05,01))
//*SORTWK06 DD UNIT=SYSDA,SPACE=(CYL,(05,01))
//*YSIN  DD  DSN=ABT.&CNTL..SORTCARD(IFC310UA),DISP=SHR
//*************************************************
//*  TRANSFER DATA FROM MVS TO AS400 ESSBASE
//*************************************************
//*RTC357UB EXEC  PGM=FTPABT
//*SYSPRINT DD SYSOUT=*
//*SYSOUT   DD SYSOUT=*
//*INPUT    DD DSN=ABT.&CNTL..SORTCARD(RTC357UB),DISP=SHR
//*AP41
//*DTAWHSFTP DATAWHSEIN
//*PUT 'ABT.AB.RTC.RTCD61' DWPROD/RTCINV.RTCINV
//*QUIT
//*******************************************************
//*LOGMSG1   EXEC  PGM=LOGMSG,
//*             COND=(0,EQ,RTC357UB),PARM=ABEND
//*SYSIN     DD  DSN=ABT.AB.SORTCARD(UTILITY),DISP=SHR
//*******************************************************
//**   SEND AS400 TRIGGER RECORD
//*******************************************************
//*RTC357UD EXEC  PGM=FTPABT
//*SYSPRINT DD SYSOUT=*
//*SYSOUT   DD SYSOUT=*
//*INPUT    DD DSN=ABT.&CNTL..SORTCARD(RTC357UD),DISP=SHR
//*AP41
//*DTAWHSFTP DATAWHSEIN
//*PUT 'ABT.AB.RTC.RTCD62' DWPROD/RTCTRG.RTCTRG
//*QUIT
//*********************************************************************
//*LOGMSG3   EXEC  PGM=LOGMSG,
//*             COND=(0,EQ,RTC357UD),PARM=ABEND
//*SYSIN     DD  DSN=ABT.AB.SORTCARD(UTILITY),DISP=SHR
//*********************************************************************
//******* END OF PROC ******  R T C 3 5 7 X X ****** END OF PROC ******
//*********************************************************************
