//QRTC02 JOB (RTC,07),'TCGM MAINTENANCE',   
// NOTIFY=TDETJB,                                    
// %4,%1,%2                                                     
/*ROUTE PRINT N1.R2017                                                          
/*JOBPARM FORMS=LAN1,S=X84A                                                     
/*RESOURCE  C=1,T=0                                                             
/*OUTPUT B01 FORMS=PR08,DEST=R2017                                          
//R43 OUTPUT COPIES=1,DEST=R2017,FORMS=PR08,CLASS=A  
//**R30 OUTPUT COPIES=1,DEST=R2017,FORMS=PR08,CLASS=R                             
//R30 OUTPUT CLASS=3,WRITER=RTCR01                                              
//**********************************************************************        
//**NAME:      QRTC30                                                **        
//**AUTHOR:    A DORFMAN                                              **        
//**DESC:      TCGM MAINTENANCE                                       **        
//**DATE:      09/29/2005                                             **        
//**MOD HISTORY                                                       **        
//**DATE       NAME                DESCRIPTION                        **        
//**========== =================== =================================  **        
//**09/29/2005 A DORFMAN           ORIGINAL                           **   
//**04/02/2007 A DORFMAN           CHANGE PRINTER TO RMT2017          **   
//**04/18/2007 A DORFMAN           CHANGE INFOPAC PRINT TO CLASS=R    ** 
//**                               ADD T07DRC TO NOFITY ON JOB CARD   **   
//**05/17/2007 A DORFMAN           MOD TO USE PRODUCTION AB FILES     **       
//*************************************************************RTC009XX         
//RTC309XX PROC CNTL='%6'                                              
//**********************************************************************        
//**NAME:      RTC309XX                                               **        
//**DESC:      UPDATE LIST FILE DATA                                  **        
//**AUTHOR:    A DORFMAN                                              **        
//**DATE:      09/29/2005                                             **        
//**MOD HISTORY                                                       **        
//**DATE       NAME                DESCRIPTION                        **        
//**========== =================== =================================  **        
//**09/29/2005 A DORFMAN           ORIGINAL                           **        
//**********************************************************************        
//**                                                                            
//*********************************************************************         
//* *** UTILITY TO TRANSFER DATA TO MVS FROM TCGM                     *         
//*********************************************************************         
//RTC309UB EXEC PGM=FTPABT                                                      
//      INCLUDE MEMBER=SYSOUTDD                                                 
//INPUT    DD  DSN=ABT.&CNTL..SORTCARD(RTC309UB),DISP=SHR   +I                  
//*********************************************************************         
//LOGMSG1   EXEC  PGM=LOGMSG,                                                   
//             COND=(0,EQ,RTC309UB),PARM=ABEND                                  
//SYSIN     DD  DSN=ABT.AB.SORTCARD(UTILITY),DISP=SHR                           
//**********************************************************************        
//**E N D    O F    P R O C   R T C 3 0 9 X X                         **        
//**********************************************************************        
//         PEND                                                                 
//RTC309XX EXEC RTC309XX,CNTL='%7'                                     
//RTC309UB.INPUT  DD  *                                                         
%8                                                                     
%9                                                                 
cd %B/RTC                                                                 
GET RTCEXPORT.rtc.processed 'ABT.DV.RTC.RTCD95' (REPLACE    
DELETE '%B/RTC/RTCEXPORT.rtc.processed'                  
QUIT                                                                            
//**********************************************************************        
//**E N D    O F    J O B      Q R T C 0 2                            **        
//**********************************************************************        
